thaiElectronic/Stm32F103c8t6/1.TFT_ILI9341/ILI9341_INIT/LIBRARY/ILI9341/ILI9341_Gui.c
#include "stm32f10x.h"
#include "ILI9341_Gui.h"
#include "ILI9341_Driver.h"
#include "ILI9341_Define.h"
#include "font.h"
#include "font_mcu.h"



void ILI9341_Gui_Clear(u16 Color){
  unsigned int i,m;  
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);   
	ILI9341_PIN_CS_RESET;
	ILI9341_PIN_DC_SET;
	
	for(i=0;i<ili_dev.height;i++){
    for(m=0;m<ili_dev.width;m++){	
			ILI9341_Send_Data_16Bit(Color);
		}
	}
	ILI9341_PIN_CS_SET;
} 

void ILI9341_Gui_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u32 color){  	
	u16 i,j;			
	u16 width=ex-sx+1; 		
	u16 height=ey-sy+1;		
	ILI9341_SetWindows(sx,sy,ex,ey);
	for(i=0;i<height;i++){
		for(j=0;j<width;j++){
			ILI9341_Send_Data_16Bit(color);	
		}
	}
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);
}


/*****************************************************************************
 * @name       :void ILI9341_Gui_Direction(u8 direction)
 * @date       :2018-08-09 
 * @function   :Setting the display direction of TFT screen
 * @parameters :direction:0-0 degree
                          1-90 degree
													2-180 degree
													3-270 degree
 * @retvalue   :None
******************************************************************************/ 
void ILI9341_Gui_Direction(u8 direction)
{ 
			ili_dev.setxcmd=0x2A;
			ili_dev.setycmd=0x2B;
			ili_dev.wramcmd=0x2C;
	switch(direction){		  
		case 0:						 	 		
			ili_dev.width=ILI9341_W;
			ili_dev.height=ILI9341_H;		
			ILI9341_WriteReg(0x36,(1<<3)|(0<<6)|(0<<7));//BGR==1,MY==0,MX==0,MV==0
		break;
		case 1:
			ili_dev.width=ILI9341_H;
			ili_dev.height=ILI9341_W;
			ILI9341_WriteReg(0x36,(1<<3)|(0<<7)|(1<<6)|(1<<5));//BGR==1,MY==1,MX==0,MV==1
		break;
		case 2:						 	 		
			ili_dev.width=ILI9341_W;
			ili_dev.height=ILI9341_H;	
			ILI9341_WriteReg(0x36,(1<<3)|(1<<6)|(1<<7));//BGR==1,MY==0,MX==0,MV==0
		break;
		case 3:
			ili_dev.width=ILI9341_H;
			ili_dev.height=ILI9341_W;
			ILI9341_WriteReg(0x36,(1<<3)|(1<<7)|(1<<5));//BGR==1,MY==1,MX==0,MV==1
		break;	
		default:break;
	}		
}	

/*****************************************************************************
 * @name       :void ILI9341_SetCursor(u16 Xpos, u16 Ypos)
 * @date       :2018-08-09 
 * @function   :Set coordinate value
 * @parameters :Xpos:the  x coordinate of the pixel
								Ypos:the  y coordinate of the pixel
 * @retvalue   :None
******************************************************************************/ 
void ILI9341_SetCursor(u16 Xpos, u16 Ypos){	  	    			
	ILI9341_SetWindows(Xpos,Ypos,Xpos,Ypos);	
} 

/*****************************************************************************
 * @name       :void DrawPoint(u16 x,u16 y)
 * @date       :2018-08-09 
 * @function   :Write a pixel data at a specified location
 * @parameters :x:the x coordinate of the pixel
                y:the y coordinate of the pixel
 * @retvalue   :None
******************************************************************************/	
void DrawPoint(u16 x, u16 y){
	ILI9341_SetCursor(x,y);
	ILI9341_Send_Data_16Bit(POINT_COLOR); 
}

/*******************************************************************
 * @name       :void ILI9341_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2)
 * @date       :2018-08-09 
 * @function   :Draw a line between two points
 * @parameters :x1:the bebinning x coordinate of the line
                y1:the bebinning y coordinate of the line
								x2:the ending x coordinate of the line
								y2:the ending y coordinate of the line
 * @retvalue   :None
********************************************************************/
void ILI9341_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2){
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 
	delta_x = x2-x1;  
	delta_y = y2-y1; 
	uRow = x1; 
	uCol = y1; 
	if(delta_x > 0) incx = 1; 
	else if(delta_x == 0) incx=0; 
	else {incx = -1; delta_x = -delta_x;} 
	if(delta_y > 0) incy = 1; 
	else if(delta_y == 0) incy = 0;
	else{incy = -1; delta_y = -delta_y;} 
	if(delta_x > delta_y) distance = delta_x; 
	else distance = delta_y; 
	for(t=0; t <= distance + 1; t++){  
		DrawPoint(uRow, uCol);
		xerr += delta_x; 
		yerr += delta_y; 
		if(xerr > distance){ 
			xerr -= distance; 
			uRow += incx; 
		} 
		if(yerr > distance){ 
			yerr -= distance; 
			uCol += incy; 
		} 
	}  
} 

/*****************************************************************************
 * @name       :void ILI9341_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2)
 * @date       :2018-08-09 
 * @function   :Draw a rectangle
 * @parameters :x1:the bebinning x coordinate of the rectangle
                y1:the bebinning y coordinate of the rectangle
								x2:the ending x coordinate of the rectangle
								y2:the ending y coordinate of the rectangle
 * @retvalue   :None
******************************************************************************/
void ILI9341_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2){
	ILI9341_DrawLine(x1,y1,x2,y1);
	ILI9341_DrawLine(x1,y1,x1,y2);
	ILI9341_DrawLine(x1,y2,x2,y2);
	ILI9341_DrawLine(x2,y1,x2,y2);
}  

/*******************************************************************
 * @name       :void ILI9341_Gui_DrawPoint(u16 x,u16 y,u16 color)
 * @date       :2018-08-09 
 * @function   :draw a point in TFT screen
 * @parameters :x:the x coordinate of the point
                y:the y coordinate of the point
								color:the color value of the point
 * @retvalue   :None
********************************************************************/
void ILI9341_Gui_DrawPoint(u16 x,u16 y,u32 color){
	ILI9341_SetCursor(x,y);
	ILI9341_Send_Data_16Bit(color); 
}

/*****************************************************************************
 * @name       :void TFT_Draw_Circle_8(int xc, int yc, int x, int y, u16 c)
 * @date       :2018-08-09 
 * @function   :8 symmetry circle drawing algorithm (internal call)
 * @parameters :xc:the x coordinate of the Circular center 
                yc:the y coordinate of the Circular center 
								x:the x coordinate relative to the Circular center 
								y:the y coordinate relative to the Circular center 
								c:the color value of the circle
 * @retvalue   :None
******************************************************************************/  
void TFT_Draw_Circle_8(int xc, int yc, int x, int y, u16 c){
	ILI9341_Gui_DrawPoint(xc + x, yc + y, c);

