thaiElectronic/Stm32F103c8t6/1.TFT_ILI9341/ILI9341_INIT/LIBRARY/ILI9341/ILI9341_Gui.c
	ILI9341_Gui_DrawPoint(xc - x, yc + y, c);

	ILI9341_Gui_DrawPoint(xc + x, yc - y, c);

	ILI9341_Gui_DrawPoint(xc - x, yc - y, c);

	ILI9341_Gui_DrawPoint(xc + y, yc + x, c);

	ILI9341_Gui_DrawPoint(xc - y, yc + x, c);

	ILI9341_Gui_DrawPoint(xc + y, yc - x, c);

	ILI9341_Gui_DrawPoint(xc - y, yc - x, c);
}

/*****************************************************************************
 * @name       :void ILI9341_Gui_Circle(int xc, int yc,u16 c,int r, int fill)
 * @date       :2018-08-09 
 * @function   :Draw a circle of specified size at a specified location
 * @parameters :xc:the x coordinate of the Circular center 
                yc:the y coordinate of the Circular center 
								r:Circular radius
								fill:1-filling,0-no filling
 * @retvalue   :None
******************************************************************************/  
void ILI9341_Gui_Circle(int xc, int yc,u16 c,int r, int fill){
	int x = 0, y = r, yi, d;
	d = 3 - 2 * r;
	if (fill){
		while (x <= y) {
			for (yi = x; yi <= y; yi++){
				TFT_Draw_Circle_8(xc, yc, x, yi, c);
			}
			if (d < 0) {
				d = d + 4 * x + 6;
			} else {
				d = d + 4 * (x - y) + 10;
				y--;
			}
			x++;
		}
	} 
	else {
		while (x <= y) {
			TFT_Draw_Circle_8(xc, yc, x, y, c);
			if (d < 0) {
				d = d + 4 * x + 6;
			} else {
				d = d + 4 * (x - y) + 10;
				y--;
			}
			x++;
		}
	}
}

/*****************************************************************************
 * @name       :void ILI9341_Gui_Draw_Triangel(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2)
 * @date       :2018-08-09 
 * @function   :Draw a triangle at a specified position
 * @parameters :x0:the bebinning x coordinate of the triangular edge 
                y0:the bebinning y coordinate of the triangular edge 
								x1:the vertex x coordinate of the triangular
								y1:the vertex y coordinate of the triangular
								x2:the ending x coordinate of the triangular edge 
								y2:the ending y coordinate of the triangular edge 
 * @retvalue   :None
******************************************************************************/ 
void ILI9341_Gui_Draw_Triangel(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2){
	ILI9341_DrawLine(x0,y0,x1,y1);
	ILI9341_DrawLine(x1,y1,x2,y2);
	ILI9341_DrawLine(x2,y2,x0,y0);
}

static void _swap(u16 *a, u16 *b){
	u16 tmp;
  tmp = *a;
	*a = *b;
	*b = tmp;
}

/*****************************************************************************
 * @name       :void ILI9431_Gui_Fill_Triangel(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2)
 * @date       :2018-08-09 
 * @function   :filling a triangle at a specified position
 * @parameters :x0:the bebinning x coordinate of the triangular edge 
                y0:the bebinning y coordinate of the triangular edge 
								x1:the vertex x coordinate of the triangular
								y1:the vertex y coordinate of the triangular
								x2:the ending x coordinate of the triangular edge 
								y2:the ending y coordinate of the triangular edge 
 * @retvalue   :None
******************************************************************************/ 
void ILI9431_Gui_Fill_Triangel(u16 x0, u16 y0, u16 x1, u16 y1, u16 x2, u16 y2){
	u16 a, b, y, last;
	int dx01, dy01, dx02, dy02, dx12, dy12;
	long sa = 0;
	long sb = 0;
 	if (y0 > y1){
    _swap(&y0,&y1); 
		_swap(&x0,&x1);
 	}
 	if (y1 > y2){
    _swap(&y2,&y1); 
		_swap(&x2,&x1);
 	}
  if (y0 > y1) {
    _swap(&y0,&y1); 
		_swap(&x0,&x1);
  }
	if(y0 == y2){ 
		a = b = x0;
		if(x1 < a){
			a = x1;
    }
    else if(x1 > b){
			b = x1;
    }
    if(x2 < a){
			a = x2;
    }
		else if(x2 > b){
			b = x2;
    }
		ILI9341_Gui_Fill(a,y0,b,y0,POINT_COLOR);
    return;
	}
	dx01 = x1 - x0;
	dy01 = y1 - y0;
	dx02 = x2 - x0;
	dy02 = y2 - y0;
	dx12 = x2 - x1;
	dy12 = y2 - y1;
	
	if(y1 == y2){
		last = y1; 
	}
  else{
		last = y1-1; 
	}
	for(y=y0; y<=last; y++) {
		a = x0 + sa / dy01;
		b = x0 + sb / dy02;
		sa += dx01;
    sb += dx02;
    if(a > b){
			_swap(&a,&b);
		}
		ILI9341_Gui_Fill(a,y,b,y,POINT_COLOR);
	}
	sa = dx12 * (y - y1);
	sb = dx02 * (y - y0);
	for(; y<=y2; y++) {
		a = x1 + sa / dy12;
		b = x0 + sb / dy02;
		sa += dx12;
		sb += dx02;
		if(a > b){
			_swap(&a,&b);
		}
		ILI9341_Gui_Fill(a,y,b,y,POINT_COLOR);
	}
}


/**
	* function: TFT_Show_6x8_char - display character 8 size 
***/
void TFT_Show_6x8_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
  u8 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+8-1,y+8-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display
		for(pos=0;pos<8;pos++){
		temp = asc2_6x8[num][pos];//Call 0806 font, you need to take the model definition
			for(t=0;t<8;t++){                 
				if(temp&0x80){
					ILI9341_Send_Data_16Bit(fc);
				}	
				else {
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}		
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<8;pos++){
	    temp = asc2_6x8[num][pos];//Call 0806 font, you need to take the model definition
	    for(t=0;t<8;t++){   
				POINT_COLOR=fc;              
				if(temp&0x80){
					DrawPoint(x+t,y+pos);//Draw a point      
				}
				temp<<=1;
	    }
		}
  }
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen     	   
}


/**
	* function: TFT_Show_6x12_char - display character 12 size 
***/
void TFT_Show_6x12_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
	u8 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+6-1,y+12-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display	
		for(pos=0;pos<12;pos++){
	    temp = asc2_6x12[num][pos];//Call 1206 font, you need to take the model definition
	    for(t=0;t<8;t++){                 
				if(temp&0x80){
					ILI9341_Send_Data_16Bit(fc);
				}
				else{
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}		
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<12;pos++){
			temp = asc2_6x12[num][pos];//Call 1206 font, you need to take the model definition
			for(t=0;t<8;t++){   
				POINT_COLOR=fc;              
				if(temp&0x80){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
			temp<<=1;
			}
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen         	   
}


/**
	* function: TFT_Show_8x16_char - display character 16 size 
***/
void TFT_Show_8x16_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
	u8 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+8-1,y+16-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display		
		for(pos=0;pos<16;pos++){
	    temp = asc2_8x16[num][pos];//Call 1608 font, you need to take the model definition
	    for(t=0;t<8;t++){                 
				if(temp&0x80){
					ILI9341_Send_Data_16Bit(fc);
				}
				else {
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<16;pos++){
	    temp = asc2_8x16[num][pos];//Call 1608 font, you need to take the model definition
	    for(t=0;t<8;t++){   
				POINT_COLOR=fc;              
				if(temp&0x80){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
				temp<<=1;
			}
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen          	   
}

/**
	* function: TFT_Show_12x24_char - display character 24 size 
***/
void TFT_Show_12x24_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
  u16 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+12-1,y+24-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display
		for(pos=0;pos<24;pos++){
			temp = (asc2_12x24[num][pos*2]<<8)|asc2_12x24[num][pos*2+1];//Call 2412 font, you need to take the model definition
			for(t=0;t<12;t++){                 
				if(temp&0x8000){
					ILI9341_Send_Data_16Bit(fc);
				}
				else{
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
	    }
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<24;pos++){
	    temp = (asc2_12x24[num][pos*2]<<8)|asc2_12x24[num][pos*2+1];//Call 2412 font, you need to take the model definition
			for(t=0;t<12;t++){   
				POINT_COLOR=fc;              
				if(temp&0x8000){
					DrawPoint(x+t,y+pos);//Draw a point     
				}
				temp<<=1;
	    }
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen       	       	   
}


/**
	* function: TFT_Show_16x32_char - display character 32 size 
***/
void TFT_Show_16x32_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
	u16 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+16-1,y+32-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display	
		for(pos=0;pos<32;pos++){
	    temp = (asc2_16x32[num][pos*2]<<8)|asc2_16x32[num][pos*2+1];//Call 3216 font, you need to take the model definition
			for(t=0;t<16;t++){                 
				if(temp&0x8000){
					ILI9341_Send_Data_16Bit(fc);
				}
				else {
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}				
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<32;pos++){
			temp = (asc2_16x32[num][pos*2]<<8)|asc2_16x32[num][pos*2+1];//Call 3216 font, you need to take the model definition
			for(t=0;t<16;t++){   
				POINT_COLOR=fc;              
				if(temp&(0x8000)){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
				temp<<=1;
			}
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen       	   
}
/**
	* function: TFT_Show_24x48_char - display character 48 size 
***/
void TFT_Show_24x48_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
	u32 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+24-1,y+48-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display		
		for(pos=0;pos<48;pos++){
	    temp = (asc2_24x48[num][pos*3]<<16)|(asc2_24x48[num][pos*3+1]<<8)|asc2_24x48[num][pos*3+2];//Call 4824 font, you need to take the model definition
	    for(t=0;t<24;t++){                 
				if(temp&0x800000){
					ILI9341_Send_Data_16Bit(fc);
				}
				else{
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
	    }	
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<48;pos++){
	    temp = (asc2_24x48[num][pos*3]<<16)|(asc2_24x48[num][pos*3+1]<<8)|asc2_24x48[num][pos*3+2];//Call 4824 font, you need to take the model definition
	    for(t=0;t<24;t++){   
				POINT_COLOR=fc;              
				if(temp&(0x800000)){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
				temp<<=1;
	    }
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen  
}

void ILI9341_Print(u16 x, u16 y, u16 fc, u16 bc, u8 size, u8 *p, u8 mode){      
	while((*p<='~')&&(*p>=' ')){
		if(size == 8){
			TFT_Show_6x8_char(x, y, fc, bc, *p, mode);
		}
		else if(size == 12){
			TFT_Show_6x12_char(x, y, fc, bc, *p, mode);
		}
		else if(size == 16){
			TFT_Show_8x16_char(x, y, fc, bc, *p, mode);
		}
		else if(size == 24){
			TFT_Show_12x24_char(x, y, fc, bc, *p, mode);
		}
		else if(size == 32){
			TFT_Show_16x32_char(x, y, fc, bc, *p, mode);
		}
		else if(size == 48){
			TFT_Show_24x48_char(x, y, fc, bc, *p, mode);
		}
		x+=size/2;
		*p++;
	}
} 

