thaiElectronic/Stm32F103c8t6/1.TFT_ILI9341/ILI9341_INIT/LIBRARY/ILI9341/ILI9341_Gui.c
/*
* function: TFT_Show_8x16B_Cnar - display character 16 size bold
*/
void TFT_Show_8x16B_Char(u16 x,u16 y,u16 fc, u16 bc, u8 num ,u8 mode){
	u8 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+8-1,y+16-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display		
		for(pos=0;pos<16;pos++){
	    temp = font_8x16B[num][pos];//Call 1608 font, you need to take the model definition
	    for(t=0;t<8;t++){                 
				if(temp&0x80){
					ILI9341_Send_Data_16Bit(fc);
				}
				else {
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<16;pos++){
	    temp = font_8x16B[num][pos];//Call 1608 font, you need to take the model definition
	    for(t=0;t<8;t++){   
				POINT_COLOR=fc;              
				if(temp&0x80){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
				temp<<=1;
			}
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen            	   
}


/**
	* function: TFT_Show_12x24B_Char - display character 24 size bold
***/
void TFT_Show_12x24B_Char(u16 x, u16 y, u16 fc, u16 bc, u8 num, u8 mode){
  u16 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+12-1,y+24-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display
		for(pos=0;pos<24;pos++){
			temp = (font_12x24B[num][pos*2]<<8)|font_12x24B[num][pos*2+1];//Call 2412 font, you need to take the model definition
			for(t=0;t<12;t++){                 
				if(temp&0x8000){
					ILI9341_Send_Data_16Bit(fc);
				}
				else{
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
	    }
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<24;pos++){
	    temp = (font_12x24B[num][pos*2]<<8)|font_12x24B[num][pos*2+1];//Call 2412 font, you need to take the model definition
			for(t=0;t<12;t++){   
				POINT_COLOR=fc;              
				if(temp&0x8000){
					DrawPoint(x+t,y+pos);//Draw a point     
				}
				temp<<=1;
	    }
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen   	
}


/**
	* function: TFT_Show_16x32B_char - display character 32 size bold
***/
void TFT_Show_16x32B_char(u16 x,u16 y,u16 fc, u16 bc, u8 num,u8 mode){
	u16 temp;
	u8 pos,t;
	u16 colortemp=POINT_COLOR;      		   
	num=num-' ';//Get the offset value
	ILI9341_SetWindows(x,y,x+16-1,y+32-1);//Set a single text display window
	if(!mode){ //Non-overlay mode: The font has a background color, which will overwrite the original display	
		for(pos=0;pos<32;pos++){
	    temp = (font_16x32B[num][pos*2]<<8)|font_16x32B[num][pos*2+1];//Call 3216 font, you need to take the model definition
			for(t=0;t<16;t++){                 
				if(temp&0x8000){
					ILI9341_Send_Data_16Bit(fc);
				}
				else {
					ILI9341_Send_Data_16Bit(bc); 
				}
				temp<<=1;
			}				
		}	
	}
	else{//Overlay mode: the font does not have a background color, and is directly superimposed and displayed on the original display content
		for(pos=0;pos<32;pos++){
			temp = (font_16x32B[num][pos*2]<<8)|font_16x32B[num][pos*2+1];//Call 3216 font, you need to take the model definition
			for(t=0;t<16;t++){   
				POINT_COLOR=fc;              
				if(temp&(0x8000)){
					DrawPoint(x+t,y+pos);//Draw a point    
				}
				temp<<=1;
			}
		}
	}
	POINT_COLOR=colortemp;	
	ILI9341_SetWindows(0,0,ili_dev.width-1,ili_dev.height-1);//Restore window to full screen       	   
}

void ILI9341_Print_Bold(u16 x, u16 y, u16 fc, u16 bc, u8 size, u8 *p, u8 mode){
	while((*p<='~')&&(*p>=' ')){
		if(size == 16){
			TFT_Show_8x16B_Char(x, y, fc, bc, *p, mode);
		}	
		else if(size == 24){
			TFT_Show_12x24B_Char(x, y, fc, bc, *p, mode);
		}
		else if(size == 32){
			TFT_Show_16x32B_char(x, y, fc, bc, *p, mode);
		}
		x+=size/2;
		*p++;
	}
}

/*****************************************************************************
 * @name       :u32 mypow(u8 m,u8 n)
 * @date       :2018-08-09 
 * @function   :get the nth power of m (internal call)
 * @parameters :m:the multiplier
                n:the power
 * @retvalue   :the nth power of m
******************************************************************************/ 
u32 mypow(u8 m,u8 n){
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}

/*****************************************************************************
 * @name       :void ILI9341_Print_Num(u16 x,u16 y,u32 num,u8 len,u8 size)
 * @date       :2018-08-09 
 * @function   :Display number
 * @parameters :x:the bebinning x coordinate of the number
                y:the bebinning y coordinate of the number
								size: the size of font display
								bold: 1-Bold(Bold: size(16,24,32))/ 0-No Bold
								num:the number(0~4294967295)
								len:the length of the display number
								size:the size of display number
 * @retvalue   :None
******************************************************************************/  			 
void ILI9341_Print_Num(u16 x, u16 y, u16 fc, u16 bc, u8 size, u8 bold, u32 num, u8 len, u8 mode){         	
	u8 t,temp;
	u8 enshow=0;	
	for(t=0;t<len;t++){
		temp=(num/mypow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1)){
			if(temp==0){
				if(bold){
					if(size == 16){
						TFT_Show_8x16B_Char(x+(size/2)*t, y, fc, bc,' ', mode);
					}	
					else if(size == 24){
						TFT_Show_12x24B_Char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 32){
						TFT_Show_16x32B_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
				}
				else{ 
					if(size == 8){
						TFT_Show_6x8_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 12){
						TFT_Show_6x12_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 16){
						TFT_Show_8x16_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 24){
						TFT_Show_12x24_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 32){
						TFT_Show_16x32_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
					else if(size == 48){
						TFT_Show_24x48_char(x+(size/2)*t, y, fc, bc,' ', mode);
					}
				}
				continue;
			}
			else enshow=1; 	 	 
		}
		if(bold){
				if(size == 16){
					TFT_Show_8x16B_Char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
				}	
				else if(size == 24){
					TFT_Show_12x24B_Char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
				}
				else if(size == 32){
					TFT_Show_16x32B_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
				}
			}
		else{ 
			if(size == 8){
				TFT_Show_6x8_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
			else if(size == 12){
				TFT_Show_6x12_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
			else if(size == 16){
				TFT_Show_8x16_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
			else if(size == 24){
				TFT_Show_12x24_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
			else if(size == 32){
				TFT_Show_16x32_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
			else if(size == 48){
				TFT_Show_24x48_char(x+(size/2)*t, y, fc, bc,temp+'0', mode);
			}
		}
	}
} 






